In [1]:
import pandas as pd
import numpy as np


# Clean up Salary, Rating, Established, and Easy Apply Columns

In [2]:
df = pd.read_csv('Data-cleaning-for-beginners-using-pandas.csv')

In [3]:
df

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        29 non-null     int64
 1   Age          22 non-null     float64
 2   Salary       29 non-null     object
 3   Rating       28 non-null     float64
 4   Location     29 non-null     object
 5   Established  29 non-null     int64
 6   Easy Apply   29 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.7+ KB

In [5]:
df.shape

(29, 7)

In [6]:
def negativeOneToNone(value):
    if value == -1:
        return None
    else:
        return value

In [7]:
df['Rating_clean'] = df['Rating'].apply(negativeOneToNone)

In [8]:
df[['Rating', 'Rating_clean']]

    Rating  Rating_clean
0      5.4           5.4
1      3.5           3.5
2     -1.0           NaN
3      4.4           4.4
4      6.4           6.4
5      1.4           1.4
6      0.0           0.0
7     -1.0           NaN
8      5.4           5.4
9      7.7           7.7
10     5.4           5.4
11     6.7           6.7
12     0.0           0.0
13    -1.0           NaN
14     4.0           4.0
15     3.0           3.0
16     4.5           4.5
17     5.3           5.3
18     6.7           6.7
19     3.3           3.3
20     5.7           5.7
21     5.0           5.0
22     7.8           7.8
23     2.4           2.4
24    -1.0           NaN
25     0.0           0.0
26     NaN           NaN
27     5.4           5.4
28     3.4           3.4

In [9]:
df['Established_clean'] = df['Established'].apply(negativeOneToNone)

In [10]:
df[['Established', 'Established_clean']]

    Established  Established_clean
0          1999             1999.0
1          2002             2002.0
2            -1                NaN
3          1988             1988.0
4          2002             2002.0
5          1999             1999.0
6            -1                NaN
7            -1                NaN
8            -1                NaN
9            -1                NaN
10         2008             2008.0
11         2009             2009.0
12         1999             1999.0
13         2019             2019.0
14         2020             2020.0
15         1999             1999.0
16         1984             1984.0
17         1943             1943.0
18         1954             1954.0
19         1955             1955.0
20         1944             1944.0
21         1946             1946.0
22         1988             1988.0
23         1999             1999.0
24         1987             1987.0
25         1980             1980.0
26         1934             1934.0
27         1935             1935.0
28         1932             1932.0

In [15]:
df['Easy Apply_clean'] = df['Easy Apply'].apply(lambda x: False if x == '-1' else True)

In [16]:
df[['Easy Apply', 'Easy Apply_clean']]

   Easy Apply  Easy Apply_clean
0        TRUE              True
1        TRUE              True
2          -1             False
3          -1             False
4          -1             False
5        TRUE              True
6          -1             False
7          -1             False
8          -1             False
9        TRUE              True
10       TRUE              True
11         -1             False
12         -1             False
13       TRUE              True
14       TRUE              True
15         -1             False
16         -1             False
17       TRUE              True
18       TRUE              True
19       TRUE              True
20       TRUE              True
21         -1             False
22       TRUE              True
23       TRUE              True
24         -1             False
25       TRUE              True
26       TRUE              True
27         -1             False
28         -1             False

In [53]:
salary_list = []
for value in df.Salary:
    salary_list.append(value)
salary_list

salary_list2 = []
for i in range(len(salary_list)):
    str = salary_list[i].replace('$', '').split('-')
    salary_list2.append(str)
salary_list2

salary_list3 = []
for item in salary_list2:
    v1 = float(item[0].replace('k', '000'))
    v2 = float(item[1].replace('k', '000'))
    salary_list3.append((v1 + v2)/2)
salary_list3

[71500.0,
 60500.0,
 83000.0,
 71500.0,
 71500.0,
 83000.0,
 71500.0,
 71500.0,
 71500.0,
 71500.0,
 29500.0,
 29500.0,
 71500.0,
 71500.0,
 71500.0,
 94500.0,
 29500.0,
 71500.0,
 71500.0,
 71500.0,
 71500.0,
 71500.0,
 60500.0,
 71500.0,
 71500.0,
 71500.0,
 60500.0,
 71500.0,
 63500.0]

In [54]:
df['Salary_clean'] = salary_list3

In [55]:
df

,Index,Age,Salary,Rating,Location,Established,Easy Apply,Rating_clean,Established_clean,Easy Apply_clean,Salary_clean
0,0,44.0,$44k-$99k,5.4,"India,In",1999,TRUE,5.4,1999.0,True,71500.0
1,1,66.0,$55k-$66k,3.5,"New York,Ny",2002,TRUE,3.5,2002.0,True,60500.0
2,2,NaN,$77k-$89k,-1.0,"New York,Ny",-1,-1,NaN,NaN,False,83000.0
3,3,64.0,$44k-$99k,4.4,India In,1988,-1,4.4,1988.0,False,71500.0
4,4,25.0,$44k-$99k,6.4,Australia Aus,2002,-1,6.4,2002.0,False,71500.0
5,5,44.0,$77k-$89k,1.4,"India,In",1999,TRUE,1.4,1999.0,True,83000.0
6,6,21.0,$44k-$99k,0.0,"New York,Ny",-1,-1,0.0,NaN,False,71500.0
7,7,44.0,$44k-$99k,-1.0,Australia Aus,-1,-1,NaN,NaN,False,71500.0
8,8,35.0,$44k-$99k,5.4,"New York,Ny",-1,-1,5.4,NaN,False,71500.0
9,9,22.0,$44k-$99k,7.7,"India,In",-1,TRUE,7.7,NaN,True,71500.0
10,10,55.0,$10k-$49k,5.4,"India,In",2008,TRUE,5.4,2008.0,True,29500.0
11,11,44.0,$10k-$49k,6.7,"India,In",2009,-1,6.7,2009.0,False,29500.0
12,12,NaN,$44k-$99k,0.0,"India,In",1999,-1,0.0,1999.0,False,71500.0
13,13,25.0,$44k-$99k,-1.0,Australia Aus,2019,TRUE,NaN,2019.0,True,71500.0
14,14,66.0,$44k-$99k,4.0,Australia Aus,2020,TRUE,4.0,2020.0,True,71500.0
15,15,44.0,$88k-$101k,3.0,Australia Aus,1999,-1,3.0,1999.0,False,94500.0
16,16,19.0,$19k-$40k,4.5,"India,In",1984,-1,4.5,1984.0,False,29500.0
17,17,NaN,$44k-$99k,5.3,"New York,Ny",1943,TRUE,5.3,1943.0,True,71500.0
18,18,35.0,$44k-$99k,6.7,"New York,Ny",1954,TRUE,6.7,1954.0,True,71500.0
19,19,32.0,$44k-$99k,3.3,"New York,Ny",1955,TRUE,3.3,1955.0,True,71500.0
20,20,NaN,$44k-$99k,5.7,"New York,Ny",1944,TRUE,5.7,1944.0,True,71500.0
21,21,35.0,$44k-$99k,5.0,"New York,Ny",1946,-1,5.0,1946.0,False,71500.0
22,22,19.0,$55k-$66k,7.8,"New York,Ny",1988,TRUE,7.8,1988.0,True,60500.0
23,23,NaN,$44k-$99k,2.4,"New York,Ny",1999,TRUE,2.4,1999.0,True,71500.0
24,24,13.0,$44k-$99k,-1.0,"New York,Ny",1987,-1,NaN,1987.0,False,71500.0
25,25,55.0,$44k-$99k,0.0,Australia Aus,1980,TRUE,0.0,1980.0,True,71500.0
26,26,NaN,$55k-$66k,NaN,"India,In",1934,TRUE,NaN,1934.0,True,60500.0
27,27,52.0,$44k-$99k,5.4,"India,In",1935,-1,5.4,1935.0,False,71500.0
28,28,NaN,$39k-$88k,3.4,Australia Aus,1932,-1,3.4,1932.0,False,63500.0

In [56]:
df[['Salary_clean', 'Rating_clean', 'Established_clean', 'Easy Apply_clean']]

    Salary_clean  Rating_clean  Established_clean  Easy Apply_clean
0        71500.0           5.4             1999.0              True
1        60500.0           3.5             2002.0              True
2        83000.0           NaN                NaN             False
3        71500.0           4.4             1988.0             False
4        71500.0           6.4             2002.0             False
5        83000.0           1.4             1999.0              True
6        71500.0           0.0                NaN             False
7        71500.0           NaN                NaN             False
8        71500.0           5.4                NaN             False
9        71500.0           7.7                NaN              True
10       29500.0           5.4             2008.0              True
11       29500.0           6.7             2009.0             False
12       71500.0           0.0             1999.0             False
13       71500.0           NaN             2019.0              True
14       71500.0           4.0             2020.0              True
15       94500.0           3.0             1999.0             False
16       29500.0           4.5             1984.0             False
17       71500.0           5.3             1943.0              True
18       71500.0           6.7             1954.0              True
19       71500.0           3.3             1955.0              True
20       71500.0           5.7             1944.0              True
21       71500.0           5.0             1946.0             False
22       60500.0           7.8             1988.0              True
23       71500.0           2.4             1999.0              True
24       71500.0           NaN             1987.0             False
25       71500.0           0.0             1980.0              True
26       60500.0           NaN             1934.0              True
27       71500.0           5.4             1935.0             False
28       63500.0           3.4             1932.0             False